Revit 2027 API
ScheduleDefinition.RemoveField(Int32) Method
 Removes a field.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveField(
	int index
)
Public Sub RemoveField (
	index As Integer
)
public:
void RemoveField(
	int index
)
member RemoveField :
        index : int -> unit
Parameters
index Int32
 The index of the field to remove.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  index is not a valid field index in this ScheduleDefinition.
See Also
Reference
ScheduleDefinition Class
RemoveField Overload
Autodesk.Revit.DB Namespace